<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\SchoolRecordType;

class SchoolRecordTypeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $arr1 = [ 'كشف الغياب اليومي للطلاب في الاختبارات', 'كشف باسماء الملاحظات اليومي', 'كشف باسماء الطلاب وفق اللجان', 'كشف تسليم اوراق الاجابة', 'جدول الاختبارات العام', 'متابعة سير أوراق الاجابة', 'محضر فتح مظروف أسئلة', 'مهام لجان الاختبارات'];
        $arr2 = [ 'كشف الغياب اليومي للطلاب في الاختبارات', 'كشف باسماء الملاحظات اليومي', 'كشف باسماء الطلاب وفق اللجان', 'كشف تسليم اوراق الاجابة', 'جدول الاختبارات العام', 'متابعة سير أوراق الاجابة', 'محضر فتح مظروف أسئلة', 'مهام لجان الاختبارات'];
        $arr3 = [ 'كشف الغياب اليومي للطلاب في الاختبارات', 'كشف باسماء الملاحظات اليومي', 'كشف باسماء الطلاب وفق اللجان', 'كشف تسليم اوراق الاجابة', 'جدول الاختبارات العام', 'متابعة سير أوراق الاجابة', 'محضر فتح مظروف أسئلة', 'مهام لجان الاختبارات'];
        $arr4 = [ 'كشف الغياب اليومي للطلاب في الاختبارات', 'كشف باسماء الملاحظات اليومي', 'كشف باسماء الطلاب وفق اللجان', 'كشف تسليم اوراق الاجابة', 'جدول الاختبارات العام', 'متابعة سير أوراق الاجابة', 'محضر فتح مظروف أسئلة', 'مهام لجان الاختبارات'];
        $arr5 = [ 'كشف الغياب اليومي للطلاب في الاختبارات', 'كشف باسماء الملاحظات اليومي', 'كشف باسماء الطلاب وفق اللجان', 'كشف تسليم اوراق الاجابة', 'جدول الاختبارات العام', 'متابعة سير أوراق الاجابة', 'محضر فتح مظروف أسئلة', 'مهام لجان الاختبارات'];
        $arr6 = [ 'كشف الغياب اليومي للطلاب في الاختبارات', 'كشف باسماء الملاحظات اليومي', 'كشف باسماء الطلاب وفق اللجان', 'كشف تسليم اوراق الاجابة', 'جدول الاختبارات العام', 'متابعة سير أوراق الاجابة', 'محضر فتح مظروف أسئلة', 'مهام لجان الاختبارات'];
        // $arr6 =['1', '2', '3', '4', '5', '6'];

        for($i = 0 ; $i < count($arr1) ; $i++)
        { 
            SchoolRecordType::create([
                'title' => $arr1[$i], 
                'school_record_id' => 1, 
            ]); 
        }
        for($i = 0 ; $i < count($arr1) ; $i++)
        { 
            SchoolRecordType::create([
                'title' => $arr1[$i], 
                'school_record_id' => 2, 
            ]); 
        }
        for($i = 0 ; $i < count($arr1) ; $i++)
        { 
            SchoolRecordType::create([
                'title' => $arr1[$i], 
                'school_record_id' => 3, 
            ]); 
        }
        for($i = 0 ; $i < count($arr1) ; $i++)
        { 
            SchoolRecordType::create([
                'title' => $arr1[$i], 
                'school_record_id' => 4, 
            ]); 
        }
        for($i = 0 ; $i < count($arr1) ; $i++)
        { 
            SchoolRecordType::create([
                'title' => $arr1[$i], 
                'school_record_id' => 5, 
            ]); 
        }
        for($i = 0 ; $i < count($arr1) ; $i++)
        { 
            SchoolRecordType::create([
                'title' => $arr1[$i], 
                'school_record_id' => 6, 
            ]); 
        }  
    }
}

